In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df1 = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])#1:Data ,2:index,3:column idex

In [4]:
df1#data frame

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546
D -0.229012  0.850762 -1.939503 -1.388513
E  0.922839  1.286948  1.598828  0.902248

In [5]:
#key point each of column in data frame is just like series in pandas shaing common index

In [6]:
df1['W']#Aceessing W column, looking like Series wanna confirm it ? use type in below tab

A   -1.935957
B   -1.783192
C   -1.640510
D   -0.229012
E    0.922839
Name: W, dtype: float64

In [7]:
type(df1['W'])#pandas.core.series.Series heance proved

pandas.core.series.Series

In [8]:
type(df1)#pandas.core.frame.DataFrame henace Df1 is data frame

pandas.core.frame.DataFrame

In [9]:
#Acessing multiple coulmn give list  of column

In [10]:
df1[['W','X']]

          W         X
A -1.935957  2.252497
B -1.783192 -0.537509
C -1.640510  0.488878
D -0.229012  0.850762
E  0.922839  1.286948

In [11]:
#adding new column in data frame

In [12]:
df1['New']= df1['W']+df1['X']

In [13]:
df1

          W         X         Y         Z       New
A -1.935957  2.252497 -1.815248 -0.519803  0.316541
B -1.783192 -0.537509  2.007955 -0.162682 -2.320700
C -1.640510  0.488878 -0.210929  0.445546 -1.151632
D -0.229012  0.850762 -1.939503 -1.388513  0.621750
E  0.922839  1.286948  1.598828  0.902248  2.209786

In [14]:
#removing the column

In [15]:
df1.drop('New',1,inplace=True)

In [16]:
df1

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546
D -0.229012  0.850762 -1.939503 -1.388513
E  0.922839  1.286948  1.598828  0.902248

In [17]:
df1.shape# (5,4)MEANS 5 ROW AND 4 COLUMN BASIC STRCTURE OF DATAFRAME

(5, 4)

In [18]:
#SELECTING ROWS OF DATA FRAME1

In [19]:
df1.loc[:'B'] #will take input as label and give output of all column

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682

In [20]:
#2ND WAY TO ACCESS THE ROW

In [21]:
df1.iloc[:3]# index base locaton give 0 to n=1

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546

In [22]:
df1.loc['B','Y']#value at row B and column at Y

2.0079554730409948

In [23]:
df1

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546
D -0.229012  0.850762 -1.939503 -1.388513
E  0.922839  1.286948  1.598828  0.902248

In [24]:
#Acessing subset of row and subset of column

In [25]:
df1.loc[['B','D'],['W','Z']]#list of row and list of column

          W         Z
B -1.783192 -0.162682
D -0.229012 -1.388513

In [26]:
df1

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546
D -0.229012  0.850762 -1.939503 -1.388513
E  0.922839  1.286948  1.598828  0.902248

In [27]:
#conditional selection and multiple index value

In [28]:
df1>0 #remember relational operator always give true or False value

       W      X      Y      Z
A  False   True  False  False
B  False  False   True  False
C  False   True  False   True
D  False   True  False  False
E   True   True   True   True

In [29]:
booldf1 = df1>0

In [30]:
booldf1 #replica of df1>0

       W      X      Y      Z
A  False   True  False  False
B  False  False   True  False
C  False   True  False   True
D  False   True  False  False
E   True   True   True   True

In [31]:
df1[booldf1] # INPLACE OF FALSE WE WILL GET NAN

          W         X         Y         Z
A       NaN  2.252497       NaN       NaN
B       NaN       NaN  2.007955       NaN
C       NaN  0.488878       NaN  0.445546
D       NaN  0.850762       NaN       NaN
E  0.922839  1.286948  1.598828  0.902248

In [32]:
df1[df1>0]   #same thing

          W         X         Y         Z
A       NaN  2.252497       NaN       NaN
B       NaN       NaN  2.007955       NaN
C       NaN  0.488878       NaN  0.445546
D       NaN  0.850762       NaN       NaN
E  0.922839  1.286948  1.598828  0.902248

In [33]:
resultdf1 =df1[df1['W']>0] #exxcept NaN

In [34]:
df1[df1['Z']<0]

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
D -0.229012  0.850762 -1.939503 -1.388513

In [35]:
resultdf1

          W         X         Y         Z
E  0.922839  1.286948  1.598828  0.902248

In [36]:
df1[df1['W']>0][['Y','Z']]

          Y         Z
E  1.598828  0.902248

In [37]:
#multiple condtion

In [38]:
df1[df1['W']>0]

          W         X         Y         Z
E  0.922839  1.286948  1.598828  0.902248

In [42]:
df1[df1['W']>0 and df1['Y']>0] # raise the error because AND operator work with only single instances of varible solution next

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [43]:
df1

          W         X         Y         Z
A -1.935957  2.252497 -1.815248 -0.519803
B -1.783192 -0.537509  2.007955 -0.162682
C -1.640510  0.488878 -0.210929  0.445546
D -0.229012  0.850762 -1.939503 -1.388513
E  0.922839  1.286948  1.598828  0.902248

In [46]:
df1[(df1['W']>0) & (df1['Y']>1)]

          W         X         Y         Z
E  0.922839  1.286948  1.598828  0.902248

In [47]:
df1[(df1['W']>0) | (df1['Y']>1)]

          W         X         Y         Z
B -1.783192 -0.537509  2.007955 -0.162682
E  0.922839  1.286948  1.598828  0.902248

In [58]:
df1

  index         W         X         Y         Z
0     A -1.935957  2.252497 -1.815248 -0.519803
1     B -1.783192 -0.537509  2.007955 -0.162682
2     C -1.640510  0.488878 -0.210929  0.445546
3     D -0.229012  0.850762 -1.939503 -1.388513
4     E  0.922839  1.286948  1.598828  0.902248

In [49]:
#resetting the index by default

In [56]:
df1.reset_index(inp

   level_0 index         W         X         Y         Z
0        0     A -1.935957  2.252497 -1.815248 -0.519803
1        1     B -1.783192 -0.537509  2.007955 -0.162682
2        2     C -1.640510  0.488878 -0.210929  0.445546
3        3     D -0.229012  0.850762 -1.939503 -1.388513
4        4     E  0.922839  1.286948  1.598828  0.902248

In [57]:
df1.loc[0:]

  index         W         X         Y         Z
0     A -1.935957  2.252497 -1.815248 -0.519803
1     B -1.783192 -0.537509  2.007955 -0.162682
2     C -1.640510  0.488878 -0.210929  0.445546
3     D -0.229012  0.850762 -1.939503 -1.388513
4     E  0.922839  1.286948  1.598828  0.902248

In [59]:
df1

  index         W         X         Y         Z
0     A -1.935957  2.252497 -1.815248 -0.519803
1     B -1.783192 -0.537509  2.007955 -0.162682
2     C -1.640510  0.488878 -0.210929  0.445546
3     D -0.229012  0.850762 -1.939503 -1.388513
4     E  0.922839  1.286948  1.598828  0.902248

In [61]:
df1

  index         W         X         Y         Z
0     A -1.935957  2.252497 -1.815248 -0.519803
1     B -1.783192 -0.537509  2.007955 -0.162682
2     C -1.640510  0.488878 -0.210929  0.445546
3     D -0.229012  0.850762 -1.939503 -1.388513
4     E  0.922839  1.286948  1.598828  0.902248

In [62]:
del df1 ['index']

In [69]:
index =['A','B','C','D','E']

In [70]:
df1['index']=['A','B','C','D','E']

In [71]:
df1

          W         X         Y         Z index
0 -1.935957  2.252497 -1.815248 -0.519803     A
1 -1.783192 -0.537509  2.007955 -0.162682     B
2 -1.640510  0.488878 -0.210929  0.445546     C
3 -0.229012  0.850762 -1.939503 -1.388513     D
4  0.922839  1.286948  1.598828  0.902248     E

In [73]:
df1.set_index('index')

              W         X         Y         Z
index
A     -1.935957  2.252497 -1.815248 -0.519803
B     -1.783192 -0.537509  2.007955 -0.162682
C     -1.640510  0.488878 -0.210929  0.445546
D     -0.229012  0.850762 -1.939503 -1.388513
E      0.922839  1.286948  1.598828  0.902248